Revit 2027 API
Form.ScaleSubElement Method
Scale a face/edge/curve/vertex of the form, by a specified origin and scale factor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ScaleSubElement(
	Reference subElementReference,
	double factor,
	XYZ origin
)
Public Sub ScaleSubElement (
	subElementReference As Reference,
	factor As Double,
	origin As XYZ
)
public:
void ScaleSubElement(
	Reference^ subElementReference,
	double factor,
	XYZ^ origin
)
member ScaleSubElement :
        subElementReference : Reference *
        factor : float *
        origin : XYZ -> unit
Parameters
subElementReference Reference
The geometry reference of face/edge/curve/vertex
factor Double
The scale factor, it should be large than zero.
origin XYZ
The origin where scale happens.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace